; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph0 - mode
	spectrograph2 - mode
	infrared3 - mode
	spectrograph1 - mode
	Star2 - direction
	GroundStation3 - direction
	Star1 - direction
	GroundStation0 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 200)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 spectrograph2)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 132)
	(supports instrument6 spectrograph1)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star1)
	(supports instrument8 spectrograph1)
	(supports instrument8 infrared3)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 113)
	(= (data Planet4 thermograph0) 107)
	(= (data Phenomenon5 thermograph0) 18)
	(= (data Planet6 thermograph0) 270)
	(= (data Phenomenon7 thermograph0) 262)
	(= (data Planet4 spectrograph2) 247)
	(= (data Phenomenon5 spectrograph2) 222)
	(= (data Planet6 spectrograph2) 41)
	(= (data Phenomenon7 spectrograph2) 25)
	(= (data Planet4 infrared3) 265)
	(= (data Phenomenon5 infrared3) 286)
	(= (data Planet6 infrared3) 1)
	(= (data Phenomenon7 infrared3) 236)
	(= (data Planet4 spectrograph1) 171)
	(= (data Phenomenon5 spectrograph1) 46)
	(= (data Planet6 spectrograph1) 236)
	(= (data Phenomenon7 spectrograph1) 224)
	(= (slew_time Star2 GroundStation0) 14.3)
	(= (slew_time GroundStation0 Star2) 14.3)
	(= (slew_time Star2 Star1) 15.24)
	(= (slew_time Star1 Star2) 15.24)
	(= (slew_time GroundStation3 GroundStation0) 16.93)
	(= (slew_time GroundStation0 GroundStation3) 16.93)
	(= (slew_time GroundStation3 Star1) 11.75)
	(= (slew_time Star1 GroundStation3) 11.75)
	(= (slew_time GroundStation3 Star2) 56.24)
	(= (slew_time Star2 GroundStation3) 56.24)
	(= (slew_time Star1 GroundStation0) 41.45)
	(= (slew_time GroundStation0 Star1) 41.45)
	(= (slew_time Planet4 GroundStation0) 10.16)
	(= (slew_time GroundStation0 Planet4) 10.16)
	(= (slew_time Planet4 Star1) 80.98)
	(= (slew_time Star1 Planet4) 80.98)
	(= (slew_time Planet4 Star2) 50.66)
	(= (slew_time Star2 Planet4) 50.66)
	(= (slew_time Planet4 GroundStation3) 18.49)
	(= (slew_time GroundStation3 Planet4) 18.49)
	(= (slew_time Phenomenon5 GroundStation0) 16.08)
	(= (slew_time GroundStation0 Phenomenon5) 16.08)
	(= (slew_time Phenomenon5 Star1) 24.34)
	(= (slew_time Star1 Phenomenon5) 24.34)
	(= (slew_time Phenomenon5 Star2) 55.25)
	(= (slew_time Star2 Phenomenon5) 55.25)
	(= (slew_time Phenomenon5 GroundStation3) 75)
	(= (slew_time GroundStation3 Phenomenon5) 75)
	(= (slew_time Phenomenon5 Planet4) 26.03)
	(= (slew_time Planet4 Phenomenon5) 26.03)
	(= (slew_time Planet6 GroundStation0) 47.26)
	(= (slew_time GroundStation0 Planet6) 47.26)
	(= (slew_time Planet6 Star1) 33.69)
	(= (slew_time Star1 Planet6) 33.69)
	(= (slew_time Planet6 Star2) 5.592)
	(= (slew_time Star2 Planet6) 5.592)
	(= (slew_time Planet6 GroundStation3) 19.76)
	(= (slew_time GroundStation3 Planet6) 19.76)
	(= (slew_time Planet6 Planet4) 74.18)
	(= (slew_time Planet4 Planet6) 74.18)
	(= (slew_time Planet6 Phenomenon5) 6.617)
	(= (slew_time Phenomenon5 Planet6) 6.617)
	(= (slew_time Phenomenon7 GroundStation0) 39.34)
	(= (slew_time GroundStation0 Phenomenon7) 39.34)
	(= (slew_time Phenomenon7 Star1) 31.53)
	(= (slew_time Star1 Phenomenon7) 31.53)
	(= (slew_time Phenomenon7 Star2) 30.24)
	(= (slew_time Star2 Phenomenon7) 30.24)
	(= (slew_time Phenomenon7 GroundStation3) 19.29)
	(= (slew_time GroundStation3 Phenomenon7) 19.29)
	(= (slew_time Phenomenon7 Planet4) 24.45)
	(= (slew_time Planet4 Phenomenon7) 24.45)
	(= (slew_time Phenomenon7 Phenomenon5) 7.051)
	(= (slew_time Phenomenon5 Phenomenon7) 7.051)
	(= (slew_time Phenomenon7 Planet6) 11.75)
	(= (slew_time Planet6 Phenomenon7) 11.75)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet4 infrared3)
	(have_image Phenomenon5 spectrograph2)
	(have_image Planet6 thermograph0)
	(have_image Phenomenon7 spectrograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 phenomenon5 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 132 to 115.92, (fuel-used) from 0 to 16.08
   goals met: 0 of 4
2. (turn_to satellite2 planet4 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 113 to 94.51, (fuel-used) from 16.08 to 34.57
   goals met: 0 of 4
3. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 4
4. (turn_to satellite2 groundstation0 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 94.51 to 84.35, (fuel-used) from 34.57 to 44.73
   goals met: 0 of 4
5. (turn_to satellite2 planet4 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 84.35 to 74.19, (fuel-used) from 44.73 to 54.89
   goals met: 0 of 4
6. (switch_on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 0 of 4
7. (switch_off instrument4 satellite1)
   deleted: (power_on instrument4)
   added: (power_avail satellite1)
   goals met: 0 of 4
8. (turn_to satellite2 groundstation0 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 74.19 to 64.03, (fuel-used) from 54.89 to 65.05
   goals met: 0 of 4
9. (calibrate satellite2 instrument8 groundstation0)
   added: (calibrated instrument8)
   goals met: 0 of 4
10. (turn_to satellite2 planet4 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 64.03 to 53.87, (fuel-used) from 65.05 to 75.21
   goals met: 0 of 4
11. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 4
12. (turn_to satellite1 star2 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 115.92 to 60.67, (fuel-used) from 75.21 to 130.46
   goals met: 0 of 4
13. (calibrate satellite1 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 0 of 4
14. (turn_to satellite1 planet6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 60.67 to 55.078, (fuel-used) from 130.46 to 136.052
   goals met: 0 of 4
15. (turn_to satellite1 phenomenon5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 55.078 to 48.461, (fuel-used) from 136.052 to 142.669
   goals met: 0 of 4
16. (take_image satellite1 phenomenon5 instrument5 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   changed: (data_capacity satellite1) from 1000 to 778, (data-stored) from 0 to 222
   goals met: 1 of 4
17. (turn_to satellite1 planet6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 48.461 to 41.844, (fuel-used) from 142.669 to 149.286
   goals met: 1 of 4
18. (take_image satellite2 planet4 instrument8 infrared3)
   added: (have_image planet4 infrared3)
   changed: (data_capacity satellite2) from 1000 to 735, (data-stored) from 222 to 487
   goals met: 2 of 4
19. (take_image satellite1 planet6 instrument5 thermograph0)
   added: (have_image planet6 thermograph0)
   changed: (data_capacity satellite1) from 778 to 508, (data-stored) from 487 to 757
   goals met: 3 of 4
20. (switch_off instrument5 satellite1)
   deleted: (power_on instrument5)
   added: (power_avail satellite1)
   goals met: 3 of 4
21. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 3 of 4
22. (turn_to satellite1 star2 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 41.844 to 36.252, (fuel-used) from 149.286 to 154.878
   goals met: 3 of 4
23. (calibrate satellite1 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 3 of 4
24. (turn_to satellite1 phenomenon7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon7)
   changed: (fuel satellite1) from 36.252 to 6.012, (fuel-used) from 154.878 to 185.118
   goals met: 3 of 4
25. (take_image satellite1 phenomenon7 instrument4 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   changed: (data_capacity satellite1) from 508 to 284, (data-stored) from 757 to 981
   goals met: 4 of 4
